#+TITLE: 编程语言学习
#+AUTHOR: LavenLiu
#+DATE: 2010-05-04
#+EMAIL: ldczz2008@163.com 

#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [a4paper,11pt]
#+LaTeX_HEADER: \usepackage[top=2.1cm,bottom=2.1cm,left=2.1cm,right=2.1cm]{geometry}
#+LaTeX_HEADER: \setmainfont[Mapping=tex-text]{Times New Roman}
#+LaTeX_HEADER: \setsansfont[Mapping=tex-text]{Tahoma}
#+LaTeX_HEADER: \setmonofont{Courier New}
#+LaTeX_HEADER: \setCJKmainfont[BoldFont={Adobe Heiti Std},ItalicFont={Adobe Kaiti Std}]{Adobe Song Std}
#+LaTeX_HEADER: \setCJKsansfont{Adobe Heiti Std}
#+LaTeX_HEADER: \setCJKmonofont{Adobe Fangsong Std}
#+LaTeX_HEADER: \punctstyle{hangmobanjiao}
#+LaTeX_HEADER: \usepackage{color,graphicx}
#+LaTeX_HEADER: \usepackage[table]{xcolor}
#+LaTeX_HEADER: \usepackage{colortbl}
#+LaTeX_HEADER: \usepackage{listings}
#+LaTeX_HEADER: \usepackage[bf,small,indentafter,pagestyles]{titlesec}

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/style2.css" />

#+OPTIONS: ^:nil

*** Global Variables
	setq is used to set variables. Variables need not be declared, and
	is global.
	#+begin_src emacs-lisp :tangle yes
(setq x 1) ; assign 1 to x
	#+end_src

 #+RESULTS:
 : 1

	#+begin_src emacs-lisp :tangle yes
(setq a 3 b 2 c 7) ; assign 3 to a, 2 to b, 7 to c
	#+end_src

 #+RESULTS:
 : 7

*** Local Variables
	To define local variables, use *let*, The form is the following,
	where <body> is (one or more) lisp expressions. The body's last
	expression's value is returned.
	#+BEGIN_EXAMPLE
	(let (<var1> <var2> ...)
	  <body>
	)
	#+END_EXAMPLE

	#+begin_src emacs-lisp :tangle yes
(let (a b)
  (setq a 3)
  (setq b 4)
  (+ a b)
)
	#+end_src

 #+RESULTS:
 : 7
	
	Another form of let is this: 
	#+BEGIN_EXAMPLE
	(let ((<var1> <val1>) (<var2> <val2>) ...)
	  <body>
	)
	#+END_EXAMPLE

	For example:
	#+begin_src emacs-lisp :tangle yes
(let ((a 3) (b 4))
(+ a b)
)
	#+end_src

 #+RESULTS:
 : 7

** Iteration
   The following code shows a loop using the *while* function. The
   format is: 
   #+BEGIN_EXAMPLE
   (while <test> <body>
   #+END_EXAMPLE
   where <body> is one or more lisp expressions.

   #+begin_src emacs-lisp :tangle yes
;(setq x 0)
;(while (< x 4)
;  (print (format "yay %d" x))
;  (setq x (1+ x)))
(let ((x 0))
(while (< x 4)
(print (format "yay %d" x))
(setq x (1+ x))))
   #+end_src

   #+RESULTS:

   In the following sample code, it inserts Unicode chars 32
   to 126. First, it sets a local variable x to 32. Then it starts a
   while loop, insert the corresponding Unicode char (in current
   buffer), then increase x by 1.
   #+begin_src emacs-lisp :tangle yes
(let ((x 32))
(while (< x 127)
(ucs-insert x)
(setq x (+ x 1)))) 
   #+end_src

   #+RESULTS:
   : !"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\]^_`abcdefghijklmnopqrstuvwxyz{|}~

